# Global Validation Messages
error.validation.dto.null=El cuerpo de la solicitud no puede estar vac\u00EDo. Por favor, complete todos los campos obligatorios.
error.validation.record.not.found=El registro solicitado no existe o est\u00E1 inactivo.
error.validation.id.required=El identificador del registro es obligatorio para esta operaci\u00F3n.

# Global Exception Handler
error.global.validation.failed=Se encontraron errores de validaci\u00F3n. Por favor, verifique los campos proporcionados.
error.global.request.readable=El cuerpo de la solicitud (JSON) tiene un formato incorrecto o est\u00E1 vac\u00EDo.
error.global.request.format=Uno o m\u00E1s campos tienen formatos de valor no v\u00E1lidos.
error.global.data.integrity=Esta operaci\u00F3n no est\u00E1 permitida debido a v\u00EDnculos existentes con otros registros.
error.global.resource.not.found=Vaya... buscamos en todos los commits, mas este recurso no fue encontrado.
error.global.internal.server=Ocurri\u00F3 un error inesperado. Nuestro equipo de ingenier\u00EDa ha sido notificado.

# Catalog Specific Messages
error.catalog.name.invalid=\u00A1{0} no v\u00E1lido! Las opciones v\u00E1lidas son: {1}.
error.catalog.name.duplicate=Ya existe un registro con este nombre. Elija otro nombre.
error.catalog.description.required=El campo 'Descripci\u00F3n' es obligatorio.
error.catalog.description.invalid.length=La descripci\u00F3n es demasiado corta (m\u00EDn. 3) o demasiado larga (m\u00E1x. 250 caracteres).

# Audit Messages
audit.action.success=Acci\u00F3n {0} realizada con \u00E9xito por el usuario {1}.
common.label.or=o

# Schema Validation
error.schema.undefined=El esquema de validaci\u00F3n no est\u00E1 definido para este contexto.
error.schema.invalid.syntax=El JSON Schema proporcionado tiene una sintaxis o estructura no v\u00E1lida.

# Feature: Features do Portal
error.feature.scope.incompatible=Para el alcance {0}, solo se permiten los siguientes tipos: {1}.
error.feature.name.duplicate.in.scope=Ya existe un registro llamado '{0}' para el alcance '{1}'.

# Feature Publisher
error.publisher.name.invalid=\u00A1{0} no v\u00E1lido! Las opciones v\u00E1lidas son: {1}.
error.publisher.label.invalid=La etiqueta debe tener entre 3 e 50 caracteres.
error.publisher.description.required=La descripci\u00F3n del publicador es obligatoria.
error.publisher.scope.invalid=Alcance del publicador no v\u00E1lido. Debe ser ACCOUNT o APPLICATION.
error.publisher.duplicate.name=Ya existe un publicador con el nombre '{0}'.

# Account Validation
validator.account.name-required=El campo 'Nombre' es obligatorio.
validator.account.name-duplicated=Ya existe una cuenta con este nombre.
validator.account.name-invalid=El campo 'Nombre' debe tener entre 3 y 100 caracteres.
validator.account.description-invalid=El campo 'Descripci\u00F3n' debe tener entre 10 y 500 caracteres.
validator.account.requester-invalid=El campo 'Solicitante' debe tener al menos 5 caracteres.
validator.account.initials-required=El campo 'Sigla' es obligatorio.
validator.account.initials-invalid=El campo 'Sigla' debe tener un m\u00E1ximo de 5 caracteres.
validator.account.email-group-invalid=El campo 'Grupo de correo electr\u00F3nico' debe contener un correo v\u00E1lido.
validator.account.approvers-required=La lista de aprobadores no puede estar vac\u00EDa.
validator.account.employee-id-required=El ID de empleado del aprobador es obligatorio.
validator.account.email-invalid=El correo electr\u00F3nico del aprobador no es v\u00E1lido.

# Account Environment Validation
validator.account-env.duplicate-publisher=El publicador ya existe en la lista.
validator.account-env.inconsistent-account=La cuenta no pertenece al entorno personalizado.
validator.account-env.min-publisher=Se requiere al menos una configuraci\u00F3n de publicador.
validator.account-env.order-required=El campo de orden es obligatorio y debe ser mayor que 0.

# Application Validation
validator.application.name-required=El nombre de la aplicaci\u00F3n es obligatorio.
validator.application.name-invalid=El nombre de la aplicaci\u00F3n debe tener entre 3 y 100 caracteres.
validator.application.name-duplicated=Ya existe una aplicaci\u00F3n con este nombre para esta cuenta.
validator.application.alias-required=El alias de la aplicaci\u00F3n es obligatorio.
validator.application.account-required=Vincular una 'Cuenta' es obligatorio.

# Environment Validation
validator.environment.name-required=El campo 'Nombre' es obligatorio. Por favor, proporcione un nombre para el entorno.
validator.environment.name-invalid=El nombre proporcionado es demasiado corto (menos de 3 caracteres) o demasiado largo (m\u00E1s de 50 caracteres).
validator.environment.description-required=El campo 'Descripci\u00F3n' es obligatorio. Por favor, proporcione una descripci\u00F3n.
validator.environment.description-invalid=La descripci\u00F3n es demasiado corta (menos de 3 caracteres) o demasiado larga (m\u00E1s de 250 caracteres).
validator.environment.custom-missing-account=No se puede registrar el entorno: se debe proporcionar la 'Cuenta' cuando el tipo es 'Custom'.
validator.environment.duplicated-default=Ya existe un entorno predeterminado con este nombre. Elija otro nombre.
validator.environment.duplicated-custom=Ya existe un entorno personalizado con este nombre para la misma cuenta.
validator.environment.account-invalid-custom=Los entornos personalizados deben estar vinculados a una cuenta v\u00E1lida.
