# Audit Messages
audit.action.success=A\u00E7\u00E3o {0} realizada com sucesso pelo usu\u00E1rio {1}.

# Common/Utility
common.label.or=ou

# Onboarding Messages
onboarding.not.found=O registro de onboarding solicitado n\u00E3o foi encontrado ou est\u00E1 inativo.

# Schema Validator Feature Messages
schema.undefined=O schema  de valida\u00E7\u00E3o n\u00E3o foi definido.
schema.invalid.syntax=A sintaxe do schema informado \u00E9 inv\u00E1lida. Verifique a estrutura JSON/Draft.
schema.value.required=O valor do atributo {0} validado pelo schema \u00E9 obrigat\u00F3rio.
schema.json.invalid.for.schema=O JSON informado no atributo {0} \u00E9 inv\u00E1lido para o schema atual.

# Global Exception Handler Messages
global.validation.failed=Um ou mais campos informados s\u00E3o inv\u00E1lidos. Verifique os detalhes.
global.request.readable=N\u00E3o foi poss\u00EDvel ler o corpo da requisi\u00E7\u00E3o. Verifique se o JSON est\u00E1 correto.
global.request.format=O formato de um ou mais campos \u00E9 incompat\u00EDvel com o esperado.
global.data.integrity=A opera\u00E7\u00E3o n\u00E3o p\u00F4de ser conclu\u00EDda devido a uma viola\u00E7\u00E3o de integridade de dados.
global.resource.not.found=O recurso solicitado n\u00E3o foi encontrado no sistema.
global.user.access.denied=Acesso n\u00E3o permitido
security.authorization.headers.missing=Acesso n\u00E3o permitido. Os atributo {0} \u00E9  obrigat\u00F3rio e  n\u00E3o foram informados no header da requisi\u00E7\u00E3o.
global.auth.user.session.not.found=Sess\u00E3o do usu\u00E1rio n\u00E3o encontrada
global.auth.user.groups.not.found=Grupos do usu\u00E1rio n\u00E3o encontrados
global.auth.user.group.missing=Usu\u00E1rio n\u00E3o possui o grupo necess\u00E1rio
global.auth.user.not.owner=Acesso negado. Esta rota \u00E9 restrita a usu\u00E1rios com perfil Owner.
global.internal.server.error=Ocorreu um erro interno inesperado. Por favor, tente novamente mais tarde. ID do Erro: {0}
global.validation.type.mismatch=O campo ''{0}'' deve ser do tipo {1}.

# Account Feature Messages
account.required=A conta \u00E9 obrigat\u00F3ria.
account.name.required=O nome da conta \u00E9 obrigat\u00F3rio.
account.name.duplicated=J\u00E1 existe uma conta com o nome: {0}.
account.name.invalid=O nome informado \u00E9 inv\u00E1lido.
account.description.invalid=A descri\u00E7\u00E3o da conta \u00E9 inv\u00E1lida.
account.requester.invalid=O solicitante informado n\u00E3o \u00E9 v\u00E1lido.
account.acronym.required=A Sigla da conta s\u00E3o obrigat\u00F3rias.
account.acronym.invalid=As Sigla informadas s\u00E3o inv\u00E1lidas.
account.email.group.invalid=O e-mail do grupo informado \u00E9 inv\u00E1lido.
account.approvers.required=\u00C9 necess\u00E1rio informar ao menos um aprovador.
account.funcional.required=O campo funcional \u00E9 obrigat\u00F3rio.
account.email.invalid=O e-mail {0} est\u00E1 em um formato incorreto.
account.restore.invalid=N\u00E3o \u00E9 poss\u00EDvel restaurar uma conta que j\u00E1 est\u00E1 ativa ou n\u00E3o existe.
account.not.found=A Conta est\u00E1 inativa ou n\u00E3o existe na base de dados.
account.already.exists=J\u00E1 existe uma conta com este dados.
account.type.invalid=O tipo da conta informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.

# Application Feature Messages
application.required=A Aplica\u00E7\u00E3o \u00E9 obrigat\u00F3ria.
application.name.required=O nome da aplica\u00E7\u00E3o \u00E9 obrigat\u00F3rio.
application.name.invalid=O nome da aplica\u00E7\u00E3o informado \u00E9 inv\u00E1lido.
application.name.duplicated=J\u00E1 existe uma aplica\u00E7\u00E3o com o nome: {0}.
application.alias.required=O alias da aplica\u00E7\u00E3o \u00E9 obrigat\u00F3rio.
application.acronym.required=A SiglaApp da aplica\u00E7\u00E3o \u00E9 obrigat\u00F3rio.
application.restore.invalid=N\u00E3o \u00E9 poss\u00EDvel restaurar uma aplica\u00E7\u00E3o que j\u00E1 est\u00E1 ativa ou n\u00E3o existe.
application.account.required=A conta associada \u00E0 aplica\u00E7\u00E3o \u00E9 obrigat\u00F3ria.
application.not.found=A aplica\u00E7\u00E3o est\u00E1 inativa ou n\u00E3o existe na base de dados.
application.already.exists=J\u00E1 existe uma aplica\u00E7\u00E3o com este dados.
application.language.invalid=O tipo de linguagem  informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
application.infrastructure.invalid=O tipo de infraestrutura informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
application.scope.invalid=O escopo informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
application.account.type.unauthorized=A aplica\u00E7\u00E3o n\u00E3o pode ser cadastrada. Somente contas do tipo {0} s\u00E3o permitidas, mas a conta informada \u00E9 do tipo: {0}.

# Catalog Feature Messages
catalog.required=O Cat\u00E1logo \u00E9 obrigat\u00F3rio.
catalog.description.required=A descri\u00E7\u00E3o do {0} \u00E9 obrigat\u00F3ria.
catalog.label.required=A descri\u00E7\u00E3o do {0} \u00E9 obrigat\u00F3ria.
catalog.description.invalid.length=A descri\u00E7\u00E3o do {0} deve ter entre {0} e {1} caracteres.
catalog.name.duplicate=J\u00E1 existe uma {0} com o nome: {1}.
catalog.name.invalid=O nome do {0} informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {1}.
catalog.scope.invalid=O scope do {0} informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {1}.
catalog.not.found=O Registro do tipo {0} est\u00E1 inativa ou n\u00E3o existe na base de dados.
catalog.restore.invalid=N\u00E3o \u00E9 poss\u00EDvel restaurar o registro do tipo {0}, pois ele j\u00E1 se encontra ativo ou n\u00E3o existe.

# Account Environment Feature Messages
account.env.duplicate.publisher=J\u00E1 existe um publicador (Publisher) duplicado para este ambiente.
account.env.inconsistent.account=A conta informada ({0}) \u00E9 inconsistente com o ambiente configurado.
account.env.min.publisher=\u00C9 necess\u00E1rio configurar pelo menos {0} publicador(es) para este ambiente.
account.env.order.required=A ordem de execu\u00E7\u00E3o/exibi\u00E7\u00E3o do ambiente \u00E9 obrigat\u00F3ria.
account.env.required=A Configura\u00E7ao da Conta no Ambiente \u00E9 obrigat\u00F3ria.
account.env.not.found=A Configura\u00E7ao da Conta  est\u00E1 inativa ou n\u00E3o existe na base de dados.
account.env.selection.required=Para prosseguir com a configura\u00E7\u00E3o, \u00E9 necess\u00E1rio informar tanto a Conta quanto o Ambiente.
account.env.publisher.scope.invalid=N\u00E3o \u00E9 permitido configurar um publicador fora do escopo de contas.


# Aplication  Environment Feature Messages
application.env.duplicate.publisher=J\u00E1 existe um publicador (Publisher) duplicado para este ambiente.
application.env.min.publisher=\u00C9 necess\u00E1rio configurar pelo menos {0} publicador(es) para este ambiente.
application.env.order.required=A ordem de execu\u00E7\u00E3o/exibi\u00E7\u00E3o do ambiente \u00E9 obrigat\u00F3ria.
application.env.required=A Configura\u00E7ao da Aplica\u00E7\u00E3o no Ambiente \u00E9 obrigat\u00F3ria.
application.env.not.found=A Configura\u00E7ao da Aplica\u00E7\u00E3o  est\u00E1 inativa ou n\u00E3o existe na base de dados.
application.env.selection.required=Para prosseguir com a configura\u00E7\u00E3o, \u00E9 necess\u00E1rio informar tanto a Aplica\u00E7\u00E3o quanto o Ambiente.

# Environment Feature Messages
environment.name.required=O nome do ambiente \u00E9 obrigat\u00F3rio.
environment.name.invalid=O nome do ambiente  deve ter entre {0} e {1} caracteres.
environment.description.required=A descri\u00E7\u00E3o do ambiente \u00E9 obrigat\u00F3ria.
environment.description.invalid=A descri\u00E7\u00E3o do ambiente deve ter entre {0} e {1} caracteres.
environment.custom.missing.account=Para ambientes do tipo CUSTOM, \u00E9 obrigat\u00F3rio informar uma conta.
environment.duplicated.default=J\u00E1 existe um ambiente padr\u00E3o com o nome: {0}.
environment.duplicated.custom=J\u00E1 existe um ambiente customizado para esta conta com o nome: {0}.
environment.account.invalid.custom=A conta informada \u00E9 inv\u00E1lida para este tipo de ambiente customizado.
environment.account.invalid.default=N\u00E3o \u00E9 permitido vincular uma conta ao ambiente padr\u00E3o (DEFAULT)
genvironment.type.invalid=O tipo do ambiente informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
environment.authorization.invalid=O tipo de autorizador informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
environment.not.found=O ambiente est\u00E1 inativo ou n\u00E3o existe na base de dados.
environment.restore.invalid=N\u00E3o \u00E9 poss\u00EDvel restaurar o ambiente, pois ele j\u00E1 se encontra ativo ou n\u00E3o existe.

# Publisher Feature Messages
publisher.name.invalid=O nome do publicador informado \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
publisher.label.required=O r\u00F3tulo (label) informado \u00E9 inv\u00E1lido.
publisher.description.required=A descri\u00E7\u00E3o do publicador \u00E9 obrigat\u00F3ria.
publisher.scope.invalid=O escopo do publicador \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
publisher.name.duplicate=J\u00E1 existe um publicador cadastrado com o nome: {0}.
publisher.not.found=O Publicador est\u00E1 inativo ou n\u00E3o existe na base de dados.
publisher.restore.invalid=N\u00E3o \u00E9 poss\u00EDvel restaurar o Publicador, pois ele j\u00E1 se encontra ativo ou n\u00E3o existe.

# Sharing Feature Messages
sharing.target.name.required=O nome do destino de compartilhamento \u00E9 obrigat\u00F3rio.
sharing.target.name.invalid=O nome deve ter entre {0} e {1} caracteres.
sharing.target.status.invalid=O status do compartilhamento informado \u00E9 inv\u00E1lido ou \u00E9 status final! Op\u00E7\u00F5es v\u00E1lidas: {0}.
sharing.target.description.required=A descri\u00E7\u00E3o do compartilhamento \u00E9 obrigat\u00F3ria.
sharing.target.description.invalid=A descri\u00E7\u00E3o  deve ter entre {0} e {1} caracteres.
sharing.target.features.required=\u00C9 necess\u00E1rio informar ao menos uma funcionalidade (feature) para o compartilhamento.
sharing.target.features.invalid=Uma ou mais funcionalidades informadas s\u00E3o inv\u00E1lidas. Op\u00E7\u00F5es v\u00E1lidas: {0}.
sharing.target.duplicate.name=J\u00E1 existe um destino de compartilhamento com o nome: {0}.
sharing.target.duplicate.features=J\u00E1 existe um destino de compartilhamento com as mesmas features: {0}.
sharing.target.application.scope.invalid=O escopo da aplica\u00E7\u00E3o para este compartilhamento \u00E9 inv\u00E1lido. Op\u00E7\u00F5es v\u00E1lidas: {0}.
sharing.target.not.found=O capartilhamento de Destino est\u00E1 inativo ou n\u00E3o existe na base de dados.
sharing.features.not.found=A feature de Compartilhamento   est\u00E1 inativo ou n\u00E3o existe na base de dados.
sharing.origin.not.found=O capartilhamento de Origem est\u00E1 inativo ou n\u00E3o existe na base de dados.
sharing.origin.duplicated=O aplicativo informado j\u00E1 possui um compartilhamento para o destino selecionado.
sharing.origin.destination.same=A aplica\u00E7\u00E3o de destino n\u00E3o pode ser igual \u00E0 origem


