# Mensajes de Auditor\u00EDa
audit.action.success=Acci\u00F3n {0} realizada con \u00E9xito por el usuario {1}.

# Comunes/Utilidades
common.label.or=o

# Mensajes de Onboarding
onboarding.not.found=El registro de onboarding solicitado no fue encontrado o est\u00E1 inactivo.

# Mensajes de Validador de Esquema
schema.undefined=El esquema de validaci\u00F3n no ha sido definido.
schema.invalid.syntax=La sintaxis del esquema es inv\u00E1lida. Verifique la estructura JSON/Draft.
schema.value.required=El valor a ser validado por el esquema es obligatorio.
schema.json.invalid.for.schema=El JSON proporcionado es inv\u00E1lido para el esquema actual. Detalles: {0}.

# Mensajes del Manejador Global de Excepciones
global.validation.failed=Uno o m\u00E1s campos informados son inv\u00E1lidos. Verifique los detalles.
global.request.readable=No fue posible leer el cuerpo de la solicitud. Verifique si el JSON es correcto.
global.request.format=El formato de uno o m\u00E1s campos es incompatible con el esperado.
global.data.integrity=La operaci\u00F3n no pudo ser completada debido a una violaci\u00F3n de integridad de datos.
global.resource.not.found=El recurso solicitado no fue encontrado en el sistema.
global.internal.server.error=Ocurri\u00F3 un error interno inesperado. Por favor, int\u00E9ntelo de nuevo m\u00E1s tarde. ID del error: {0}.

# Mensajes de Cuenta (Account)
account.required=La cuenta es obligatoria.
account.name.required=El nombre de la cuenta es obligatorio.
account.name.duplicated=Ya existe una cuenta con el nombre: {0}.
account.name.invalid=El nombre informado es inv\u00E1lido.
account.description.invalid=La descripci\u00F3n de la cuenta es inv\u00E1lida.
account.requester.invalid=El solicitante informado no es v\u00E1lido.
account.initials.required=Las iniciales de la cuenta son obligatorias.
account.initials.invalid=Las iniciales informadas son inv\u00E1lidas.
account.email.group.invalid=El correo electr\u00F3nico del grupo informado es inv\u00E1lido.
account.approvers.required=Es necesario informar al menos un aprobador.
account.funcional.required=El campo funcional es obligatorio.
account.email.invalid=El correo electr\u00F3nico {0} tiene un formato incorrecto.
account.restore.invalid=No es posible restaurar una cuenta que ya est\u00E1 activa.
account.not.found=La cuenta est\u00E1 inactiva o no existe en la base de datos.
account.already.exists=Ya existe una cuenta con estos datos.

# Mensajes de Aplicaci\u00F3n
application.required=La aplicaci\u00F3n es obligatoria.
application.name.required=El nombre de la aplicaci\u00F3n es obligatorio.
application.name.invalid=El nombre de la aplicaci\u00F3n informado es inv\u00E1lido.
application.name.duplicated=Ya existe una aplicaci\u00F3n con el nombre: {0}.
application.alias.required=El alias de la aplicaci\u00F3n es obligatorio.
application.account.required=La cuenta asociada a la aplicaci\u00F3n es obligatoria.
application.not.found=La aplicaci\u00F3n est\u00E1 inactiva o no existe en la base de datos.
application.already.exists=Ya existe una aplicaci\u00F3n con estos datos.
application.language.invalid=El tipo de lenguaje informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
application.infrastructure.invalid=El tipo de infraestructura informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
application.scope.invalid=El alcance (scope) informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
application.account.type.unauthorized=La aplicaci\u00F3n no puede ser registrada. Solo se permiten cuentas de tipo {0}, pero la cuenta informada es de tipo: {1}.

# Mensajes de Cat\u00E1logo
catalog.required=El cat\u00E1logo es obligatorio.
catalog.description.required=La descripci\u00F3n de {0} es obligatoria.
catalog.label.required=La etiqueta de {0} es obligatoria.
catalog.description.invalid.length=La descripci\u00F3n de {0} debe tener entre {1} y {2} caracteres.
catalog.name.duplicate=Ya existe una {0} con el nombre: {1}.
catalog.name.invalid=El nombre de {0} informado es inv\u00E1lido. Opciones v\u00E1lidas: {1}.
catalog.scope.invalid=El alcance de {0} informado es inv\u00E1lido. Opciones v\u00E1lidas: {1}.
catalog.not.found=El registro de tipo {0} est\u00E1 inactivo o no existe en la base de datos.
catalog.restore.invalid=No es posible restaurar el registro de tipo {0}, ya que se encuentra activo.

# Mensajes de Ambiente de Cuenta
account.env.duplicate.publisher=Ya existe un publicador (Publisher) duplicado para este ambiente.
account.env.inconsistent.account=La cuenta informada ({0}) es inconsistente con el ambiente configurado.
account.env.min.publisher=Es necesario configurar al menos {0} publicador(es) para este ambiente.
account.env.order.required=El orden de ejecuci\u00F3n/visualizaci\u00F3n del ambiente es obligatorio.
account.env.required=La configuraci\u00F3n de la cuenta en el ambiente es obligatoria.
account.env.not.found=La configuraci\u00F3n de la cuenta est\u00E1 inactiva o no existe en la base de datos.
account.env.selection.required=Para continuar con la configuraci\u00F3n, es necesario informar tanto la cuenta como el ambiente.

# Mensajes de Ambiente de Aplicaci\u00F3n
application.env.duplicate.publisher=Ya existe un publicador duplicado para este ambiente.
application.env.min.publisher=Es necesario configurar al menos {0} publicador(es) para este ambiente.
application.env.order.required=El orden de ejecuci\u00F3n/visualizaci\u00F3n del ambiente es obligatorio.
application.env.required=La configuraci\u00F3n de la aplicaci\u00F3n en el ambiente es obligatoria.
application.env.not.found=La configuraci\u00F3n de la aplicaci\u00F3n est\u00E1 inactiva o no existe en la base de datos.
application.env.selection.required=Para continuar con la configuraci\u00F3n, es necesario informar tanto la aplicaci\u00F3n como el ambiente.

# Mensajes de Ambiente (Environment)
environment.name.required=El nombre del ambiente es obligatorio.
environment.name.invalid=El nombre del ambiente debe tener entre {0} e {1} caracteres.
environment.description.required=La descripci\u00F3n del ambiente es obligatoria.
environment.description.invalid=La descripci\u00F3n del ambiente debe tener entre {0} e {1} caracteres.
environment.custom.missing.account=Para ambientes de tipo CUSTOM, es obligatorio informar una cuenta.
environment.duplicated.default=Ya existe un ambiente predeterminado con el nombre: {0}.
environment.duplicated.custom=Ya existe un ambiente personalizado para esta cuenta con el nombre: {0}.
environment.account.invalid.custom=La cuenta informada es inv\u00E1lida para este tipo de ambiente personalizado.
environment.type.invalid=El tipo de ambiente informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
environment.authorization.invalid=El tipo de autorizador informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
environment.not.found=El ambiente est\u00E1 inactivo o no existe en la base de datos.

# Mensajes de Publicador (Publisher)
publisher.name.invalid=El nombre del publicador informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
publisher.label.required=La etiqueta (label) informada es inv\u00E1lida.
publisher.description.required=La descripci\u00F3n del publicador es obligatoria.
publisher.scope.invalid=El alcance del publicador es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
publisher.name.duplicate=Ya existe un publicador registrado con el nombre: {0}.
publisher.not.found=El publicador est\u00E1 inactivo o no existe en la base de datos.

# Mensajes de Uso Compartido (Sharing)
sharing.target.name.required=El nombre del destino de uso compartido es obligatorio.
sharing.target.name.invalid=El nombre debe tener entre {0} e {1} caracteres.
sharing.target.status.invalid=El estado del uso compartido informado es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
sharing.target.description.required=La descripci\u00F3n del uso compartido es obligatoria.
sharing.target.description.invalid=La descripci\u00F3n debe tener entre {0} e {1} caracteres.
sharing.target.features.required=Es necesario informar al menos una funcionalidad para el uso compartido.
sharing.target.features.invalid=Una o m\u00E1s funcionalidades informadas son inv\u00E1lidas. Opciones v\u00E1lidas: {0}.
sharing.target.duplicate.name=Ya existe un destino de uso compartido con el nombre: {0}.
sharing.target.application.scope.invalid=El alcance de la aplicaci\u00F3n para este uso compartido es inv\u00E1lido. Opciones v\u00E1lidas: {0}.
sharing.target.not.found=El destino de uso compartido est\u00E1 inactivo o no existe en la base de datos.
sharing.features.not.found=La funcionalidad de uso compartido est\u00E1 inactiva o no existe en la base de datos.
sharing.origin.not.found=El origen de uso compartido est\u00E1 inactivo o no existe en la base de datos.
